/* data.js —— 底图参照 + 初始点位（由 campus_data.json 生成；可手改） */
window.CAMPUS = {
 "campus": "中国人民公安大学 团河校区",
 "M_PER_PX": 0.918,
 "geo": {
  "lon_tl": 116.353455,
  "lat_tl": 39.770548,
  "dlo": 1.07285e-05,
  "dla": 8.2474e-06
 },
 "sat": {
  "src": "sat.jpg",
  "w": 4864,
  "h": 2816,
  "lon_tl": 116.354828,
  "lat_tl": 39.770548,
  "dlo": 5.364309e-06,
  "dla": 4.12358e-06
 },
 "pois": [
  {
   "id": "G1",
   "name": "南1门（主出入口）",
   "cat": "gate",
   "px": [
    1390.67,
    880.8
   ]
  },
  {
   "id": "B1",
   "name": "图书馆",
   "cat": "lib",
   "px": [
    1000.0,
    770.0
   ]
  },
  {
   "id": "B2",
   "name": "铸剑楼",
   "cat": "teach",
   "px": [
    1215.0,
    712.0
   ]
  },
  {
   "id": "B3",
   "name": "教学楼",
   "cat": "teach",
   "px": [
    1370.0,
    812.0
   ]
  },
  {
   "id": "B4",
   "name": "实验楼（东区）",
   "cat": "teach",
   "px": [
    1450.0,
    690.0
   ]
  },
  {
   "id": "B5",
   "name": "攀登楼",
   "cat": "teach",
   "px": [
    975.0,
    500.0
   ]
  },
  {
   "id": "F1",
   "name": "接待餐厅",
   "cat": "food",
   "px": [
    1590.0,
    782.0
   ]
  },
  {
   "id": "S1",
   "name": "田径场（400m）",
   "cat": "sport",
   "px": [
    1393.0,
    550.0
   ]
  },
  {
   "id": "S2",
   "name": "田径场看台",
   "cat": "sport",
   "px": [
    1318.0,
    530.0
   ]
  },
  {
   "id": "S3",
   "name": "南篮球场",
   "cat": "sport",
   "px": [
    1580.0,
    845.0
   ]
  },
  {
   "id": "S4",
   "name": "射击场",
   "cat": "sport",
   "px": [
    1795.0,
    440.0
   ]
  },
  {
   "id": "D12",
   "name": "学生公寓12",
   "cat": "dorm",
   "px": [
    1745.0,
    528.0
   ]
  },
  {
   "id": "D11",
   "name": "学生公寓11",
   "cat": "dorm",
   "px": [
    1750.0,
    580.0
   ]
  },
  {
   "id": "D10",
   "name": "学生公寓10",
   "cat": "dorm",
   "px": [
    1755.0,
    612.0
   ]
  },
  {
   "id": "D9",
   "name": "学生公寓9",
   "cat": "dorm",
   "px": [
    1750.0,
    668.0
   ]
  },
  {
   "id": "D8",
   "name": "学生公寓8",
   "cat": "dorm",
   "px": [
    1765.0,
    700.0
   ]
  },
  {
   "id": "D7",
   "name": "学生公寓7",
   "cat": "dorm",
   "px": [
    1685.0,
    788.0
   ]
  },
  {
   "id": "D6",
   "name": "学生公寓6",
   "cat": "dorm",
   "px": [
    1695.0,
    822.0
   ]
  },
  {
   "id": "D5",
   "name": "学生公寓5号楼",
   "cat": "dorm",
   "px": [
    1700.0,
    872.0
   ]
  },
  {
   "id": "U1",
   "name": "二食堂",
   "cat": "food",
   "px": [
    1769.23,
    717.05
   ]
  },
  {
   "id": "U2",
   "name": "三食堂",
   "cat": "food",
   "px": [
    1782.71,
    781.36
   ]
  },
  {
   "id": "U3",
   "name": "澡堂",
   "cat": "bath",
   "px": [
    1779.63,
    826.03
   ]
  },
  {
   "id": "U4",
   "name": "快递柜（2-6）",
   "cat": "parcel",
   "px": [
    1779.63,
    868.78
   ]
  },
  {
   "id": "U5",
   "name": "快递站（1号柜、大件区、顺丰京东快递寄送专区）",
   "cat": "parcel",
   "px": [
    1635.45,
    873.69
   ]
  },
  {
   "id": "U6",
   "name": "外卖柜",
   "cat": "parcel",
   "px": [
    1528.2,
    875.86
   ]
  },
  {
   "id": "U7",
   "name": "西配楼",
   "cat": "teach",
   "px": [
    1310.41,
    814.61
   ]
  },
  {
   "id": "U8",
   "name": "中楼",
   "cat": "teach",
   "px": [
    1385.84,
    793.53
   ]
  },
  {
   "id": "U9",
   "name": "东配楼",
   "cat": "teach",
   "px": [
    1459.33,
    816.54
   ]
  },
  {
   "id": "U12",
   "name": "警大楼",
   "cat": "teach",
   "px": [
    1296.49,
    709.59
   ]
  },
  {
   "id": "U13",
   "name": "校医院",
   "cat": "clinic",
   "px": [
    1339.93,
    708.86
   ]
  },
  {
   "id": "U14",
   "name": "AB楼",
   "cat": "teach",
   "px": [
    1161.11,
    771.85
   ]
  },
  {
   "id": "U15",
   "name": "团阶",
   "cat": "teach",
   "px": [
    1254.77,
    828.43
   ]
  },
  {
   "id": "U10",
   "name": "德克士",
   "cat": "food",
   "px": [
    1525.88,
    748.07
   ]
  },
  {
   "id": "U11",
   "name": "好邻居超市",
   "cat": "shop",
   "px": [
    1562.33,
    747.5
   ]
  },
  {
   "id": "U16",
   "name": "一食堂",
   "cat": "food",
   "px": [
    1547.34,
    697.2
   ]
  },
  {
   "id": "U17",
   "name": "网球场",
   "cat": "sport",
   "px": [
    1528.97,
    580.21
   ]
  },
  {
   "id": "U18",
   "name": "篮球馆",
   "cat": "sport",
   "px": [
    1570.23,
    544.01
   ]
  },
  {
   "id": "U19",
   "name": "排球场",
   "cat": "sport",
   "px": [
    1526.79,
    486.81
   ]
  },
  {
   "id": "U20",
   "name": "西苑平房",
   "cat": "teach",
   "px": [
    1051.81,
    483.66
   ]
  },
  {
   "id": "U21",
   "name": "西苑训练场",
   "cat": "sport",
   "px": [
    877.62,
    540.09
   ]
  },
  {
   "id": "U22",
   "name": "西苑观礼台",
   "cat": "other",
   "px": [
    783.74,
    531.8
   ]
  },
  {
   "id": "U23",
   "name": "战训馆",
   "cat": "sport",
   "px": [
    913.98,
    303.56
   ]
  },
  {
   "id": "U24",
   "name": "综训馆",
   "cat": "sport",
   "px": [
    791.6,
    280.52
   ]
  },
  {
   "id": "U25",
   "name": "警务心理训练场",
   "cat": "sport",
   "px": [
    1090.8,
    202.64
   ]
  },
  {
   "id": "U26",
   "name": "未来警务学院",
   "cat": "teach",
   "px": [
    1020.69,
    209.04
   ]
  },
  {
   "id": "U27",
   "name": "学生荟",
   "cat": "food",
   "px": [
    1021.16,
    221.31
   ]
  },
  {
   "id": "U28",
   "name": "战训协同实验室",
   "cat": "teach",
   "px": [
    1056.08,
    275.58
   ]
  },
  {
   "id": "U29",
   "name": "被装超市",
   "cat": "shop",
   "px": [
    1043.82,
    275.11
   ]
  },
  {
   "id": "U30",
   "name": "荣泽府",
   "cat": "other",
   "px": [
    1066.47,
    304.36
   ]
  },
  {
   "id": "U31",
   "name": "忠诚广场",
   "cat": "other",
   "px": [
    1180.53,
    542.61
   ]
  },
  {
   "id": "U32",
   "name": "警苑超市",
   "cat": "shop",
   "px": [
    1303.39,
    552.39
   ]
  },
  {
   "id": "U33",
   "name": "北篮球场",
   "cat": "sport",
   "px": [
    1633.29,
    479.48
   ]
  },
  {
   "id": "U34",
   "name": "文化广场",
   "cat": "other",
   "px": [
    1634.48,
    583.47
   ]
  },
  {
   "id": "U35",
   "name": "礼堂",
   "cat": "other",
   "px": [
    1565.16,
    630.09
   ]
  },
  {
   "id": "U36",
   "name": "外卖点位（图书馆前）",
   "cat": "parcel",
   "px": [
    1000.0,
    798.0
   ],
   "note": "原地图未标注，日常取外卖"
  }
 ],
 "roads": [
  {
   "name": "创新道",
   "polyline": [
    [
     710.0,
     424.0
    ],
    [
     1860.0,
     424.0
    ]
   ]
  },
  {
   "name": "勤奋道",
   "polyline": [
    [
     710.0,
     655.0
    ],
    [
     1860.0,
     655.0
    ]
   ]
  },
  {
   "name": "求实道",
   "polyline": [
    [
     900.0,
     733.0
    ],
    [
     1750.0,
     733.0
    ]
   ]
  },
  {
   "name": "忠诚道",
   "polyline": [
    [
     1000.0,
     806.0
    ],
    [
     1800.0,
     806.0
    ]
   ]
  },
  {
   "name": "警训路",
   "polyline": [
    [
     985.0,
     182.0
    ],
    [
     985.0,
     430.0
    ]
   ]
  },
  {
   "name": "北区横路",
   "polyline": [
    [
     845.0,
     242.0
    ],
    [
     1085.0,
     242.0
    ]
   ]
  },
  {
   "name": "北纵路",
   "polyline": [
    [
     1085.0,
     182.0
    ],
    [
     1085.0,
     300.0
    ]
   ]
  },
  {"name": "警知路", "polyline": [[1125, 424], [1125, 812]]},
  {
   "name": "警学路",
   "polyline": [
    [
     1265.0,
     200.0
    ],
    [
     1265.0,
     700.0
    ]
   ]
  },
  {
   "name": "警思路",
   "polyline": [
    [
     730.0,
     755.0
    ],
    [
     730.0,
     935.0
    ]
   ]
  },
  {"name": "正心路", "polyline": [[1620, 424], [1620, 900]]},
  {
   "name": "修身路",
   "polyline": [
    [
     1800.0,
     395.0
    ],
    [
     1800.0,
     900.0
    ]
   ]
  },
  {
   "name": "黄亦路",
   "polyline": [
    [
     600.0,
     862.0
    ],
    [
     1990.0,
     905.0
    ]
   ]
  },
  {
   "name": "广平大街",
   "polyline": [
    [
     640.0,
     0.0
    ],
    [
     640.0,
     1536.0
    ]
   ]
  }
 ],
 "boundary": [
  [
   702.0,
   166.0
  ],
  [
   1118.0,
   178.0
  ],
  [
   1118.0,
   322.0
  ],
  [
   1842.0,
   336.0
  ],
  [
   1840.0,
   912.0
  ],
  [
   702.0,
   866.0
  ]
 ]
};
